#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
    This file is a part of the lor_neuro_rat project.
    Copyright (C) 2019 anonimous

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.

    Please contact with me by E-mail: shkolnick.kun@gmail.com
"""
#БЛД! АУЕ забыл!!!
#TODO: дополнить соварь
#TODO: могут быть контекстно-зависимые трактовки
import re
JAFA  = {re.compile(r'\b(a\.?f\.?a\.?i\.?k|A\.?F\.?A\.?I\.?K|е\.?м\.?н\.?и\.?п|Е\.?М\.?Н\.?И\.?П)\b'):'если мне не изменяет память',
         re.compile(r'\b(i\.?m\.?h\.?o|I\.?M\.?H\.?O|и\.?м\.?х\.?о|И\.?М\.?Х\.?О|п\.?м\.?с\.?м|П\.?М\.?С\.?М)\b'):'по моему скромному мнению',
         re.compile(r'\b(a\.?i\.?s\.?b|A\.?I\.?S\.?B)\b'):'как я уже говорил',
         re.compile(r'\b(b\.?t\.?w|B\.?T\.?W)\b'):'кстати',
         re.compile(r'\b(c\.?y\.?a|C\.?Y\.?A|c\.?u|C\.?U)\b'):'подстрахуйся',
         re.compile(r'\b([dD]\.?[dD]\.?[oO]\.?[sS]|[дД]\.?[дД]\.?[оО]\.?[сС])\b'):'распределенный отказ в обслуживании',
         re.compile(r'\b[fF]\.?[aA]\.?[cC]\b'):'частозадаваемые вопросы',
         re.compile(r'\b[fF]\.?[tT]\.?[gG]\.?[jJ]\b'):'во имя великой справедливости',
         re.compile(r'\b([gG]\.?[tT]\.?[aA]|[гГ]\.?[Тт]\.?[аА])\b'):'криминальная игра',
         re.compile(r'\b([gG]\.?[tT]\.?[fF]\.?[oO]|[гГ]\.?[тТ]\.?[фФ]\.?[оО])\b'):'уебывай отсюда',
         re.compile(r'\b([iI]2[pP]|[иИ]2[пП]|[аА][йЙ][тТ][уУ][Пп][иИ])\b'):'проект невидимый интернет',
         re.compile(r'\b([iI]\.?[aA]\.?[nN]\.?[aA]\.?[Ll]|[иИ]\.?[аА]\.?[Нн]\.?[аА]\.?[лЛ])\b'):'я не адвокат',
         re.compile(r'\b([iI][nN][bB]4|[иИ][нН][Бб]4|[иИ][нН][бБ][иИ][фФ][оО])\b'):'ожидаю',
         re.compile(r'\b([иИ]\.?[тТ]\.?[тТ]|[iI]\.?[tT]\.?[tT])\b'):'в этом треде',
         re.compile(r'\b([lL]\.?[mM]\.?[aA]\.?[oO]|[lL]\.?[oO]\.?[lL]|[лЛ]\.?[Мм]\.?[Аа]\.?[Оо]|[лЛ]\.?[Оо]\.?[лЛ])\b'):'очень смешно',
         re.compile(r'\b([jJ]\.?[Ff]\.?[Gg]\.?[Ii]|[uU]\.?[Tt]\.?[Ff]\.?[gG])\b'):'поищщи в гугле блядь',
         re.compile(r'\b([lL]\.?[oO]\.?[Ii]\.?[Cc]|[лЛ]\.?[Оо]\.?[Ии]\.?[сСкК])\b'):'низкоорбитальная ионная пушка',
         re.compile(r'\b([pP]2[pP]|[пП]2[пП])\b'):'пиринговая сеть',
         re.compile(r'\b([oO]\.?[mM]\.?[gG]|[оО]\.?[мМ]\.?[Гг])\b'):'о мой бог',
         re.compile(r'\b([rR]\.?[tT]\.?[Ff]\.?[mM]|[рР]\.?[тТ]\.?[Фф]\.?[Мм])\b'):'прочти инструкцию блядь',
         re.compile(r'\b([sS]\.?[tT]\.?[fF]\.?[uU]|[сС]\.?[тТ]\.?[Фф]\.?[УуЮю])\b'):'заткнись блядь',
         re.compile(r'\b[tT]\.?[lL][\.\;]?[Dd]\.?[Rr]\b'):'длинный текст не читал',
         re.compile(r'\b[tT]\.?[oO]\.?[rR]\b'):'луковый роутер',
         re.compile(r'\b([wW]\.?[Tt]\.?[Ff]|[вВ]\.?[тТ]\.?[Фф])\b'):'какого хуя вопрос',
         re.compile(r'\b[yY]\.?[oO]\.?[bB]\.?[aA]\b'):'сделано для школоты одобрено быдлом',
         re.compile(r'\b[аА]\.?[пП]\.?[вВ]\.?[оО]\.?[нН]\.?[вВ]\b'):'а почему вы отвечете вопросом на вопрос',
         re.compile(r'\b[аА]\.?[пП]\.?[вВ]\.?[сС]\b'):'а почему вы спрашиваете',
         re.compile(r'\b[аА]\.?[сС]\.?[дД]\.?[пП]\b'):'анус себе дерни пес',
         re.compile(r'\b[тТ]\.?[Нн]\.?[уУ]\.?[сС]\b'):'бабы не умеют срать',
         re.compile(r'\b[сС]\.?[уУ]\.?[гГ]\.?[сС]\b'):'нацистское приветствие украина',
         re.compile(r'\b[бБ]\.?[бБ]\.?[пП]\.?[еЕ]\b'):'бей бабу по ебалу',
         re.compile(r'\b[сС]\.[лЛ]\.[оО]\.[нН]\b'):'смерт легавым от ножа',
         re.compile(r'\b[иИ]\.[рР]\.[аА]\b'):'иду резать актив',
         re.compile(r'\b[бБ]\.?[хХ]\.?[кК]\.?[тТ]\.?[пП]\b'):'блядь хуйню какую то пишете',
         re.compile(r'\b[еЕ]\.?[бБ]\.?[мМ]\.?[пП]\b'):'если старое мне по хуй',
         re.compile(r'\b[еЕ]\.?[вВ]\.?[пП]\.?[оО]\.?[чЧ]\.?[яЯ]\b'):'если вы понимаете о чем я',
         re.compile(r'\b[eE]\.?[оО]\.?[тТ]\b'):'есть одна баба',
         re.compile(r'\b[еЕ]\.?[оО]\.?[кК]\b'):'есть один мужик',
         re.compile(r'\b[иИ]\.?[чЧ]\.?([сС]\.?)?[хХ]\b'):'и что характерно',
         re.compile(r'\b[кК]\.?[гГ][\.\/]?[аА]\.?[мМ]\b'):'креатив говно автор мудак',
         re.compile(r'\b[кК]\.?[лЛ]\.?[бБ]\b'):'к логопеду быдло',
         re.compile(r'\b[лЛ]\.?[пП]\.?[пП]\b'):'лож восклицанние',
         re.compile(r'\b[мМ]\.?[пП]\.?[хХ]\b'):'хуй',
         re.compile(r'\b[нН]\.?[еЕёЁ]\.?[хХ]\b'):'нечто неведомое',
         re.compile(r'\b[пП]\.?[гГ]\.?[мМ]\b'):'православие головного мозга',
         re.compile(r'\b[пП]\.?[нН]\.?[хХ]\b'):'пошел на хуй',
         re.compile(r'\b[пП]\.?[пП]\.?[кК]\.?[сК]\b'):'поддерживаю восклицанние',
         re.compile(r'\b[сС]\.?[пП]\.?[гГ]\.?[сК]\b'):'синдром поиска глубинного смысла',
         re.compile(r'\b[сС]\.?[сС]\.?[зЗ]\.?[Бб]\b'):'сам себе создает проблемы',
         re.compile(r'\b[сС]\.?[хХ]\.?[бБ]\b'):'соси хуй быдло восклицанние',
         re.compile(r'\b[хХ]\.?[зЗ]\.?[кК]\.?[нН]\.?[рР]\b'):'непонятно как работает',
         re.compile(r'\b[хХ]\.?[зЗ]\b'):'непонятно',
         re.compile(r'\b[чЧ]\.?[сС]\.?[вВ]\b'):'чувство собственного величия',
         re.compile(r'\b[эЭ]\.?[оО]\.?[сС]\b'):'плохой опрос восклицание',
         re.compile(r'\b[яЯ]\.?[нН]\.?[нН]\.?[пП]\b'):'я ничего не понял',
         re.compile(r'\b[яЯ]\.?[пП]\.?[оО]\.?[эЭ]\.?[зЗ]\b'):'я просто оставлю это здесь',
         re.compile(r'\b14\/?88\b'):'нацистское приветствие',
         re.compile(r'\b([aA]\.?[cC]\.?[aA]\.?[bB]|[аА]\.?[кКсС]\.?[аА]\.?[бБ])\b'):'все менты ублюдки',
         re.compile(r'\b[aAаА]\.?[kKкК]\.?[aAаА]\b'):'так же известный как',
         re.compile(r'\b([aA]\.?[sS]\.?[aA]\.?[pP]|[аА]\.?[сС]\.?[аА]\.?[пП])\b'):'как можно скорее',
         re.compile(r'\b([kK]\.?[kK]\.?[kK]|[кК]\.?[кК]\.?[кК])\b'):'ку клукс клан',
         re.compile(r'\b[nN]\.?[bB]\b'):'обрати внимание',
         re.compile(r'\b([зЗ]\.?[ыЫ]|[pP]\.?[sS])\b'):'постскриптум',
         re.compile(r'\b([зЗ]\.?[оО]\.?[гГ]|[zZ]\.?[oO]\.?[gG])\b'):'сионистское окупационное правительство',
         re.compile(r'\b([aA][kK]|[аА][кК])(\-?(47|74)|[мМmM])\b'):'автомат калашникова',
         re.compile(r'\b[гГ]([аА][иИ]|[иИ][бБ][дД][дД])\b'):'государственная авто инспекция',
         re.compile(r'\b([kK]\.?[kK]\.?[kK]|[кК]\.?[кК]\.?[кК])\b'):'ку клукс клан',
         re.compile(r'\b[дД]\.?[пП]\.?[нН]\.?[иИ]\b'):'движение против нелегальной иммиграции',
         re.compile(r'\b[еЕ]\.?[дД]\.?[рР]\.?[оО]\b'):'единая россия',
         re.compile(r'\b[кК]\.?[мМ]\.?[пП]\.?[кК]\.?[вВ]\b'):'когда мы придем к власти',
         re.compile(r'\b[оО]\.?[бБ]\.?[сС]\b'):'одна бабка сказала',
         re.compile(r'\b[оО]\.?[пП]\.?[сС]\.?[оО]\.?[сС]\b'):'оператор сотовой связи',
         re.compile(r'\b[Пп]\.?[нН]\.?[кК]\.?[сС]\b'):'русское православное нацоинал-коммунистическое самодержавие',
         re.compile(r'\b[рР]\.?[жЖ]\.?[дД]\b'):'российские железные дороги',
         re.compile(r'\b[рР]\.?[пП]\.?[цЦ]\b'):'русская православная церковь',
         re.compile(r'\b[сС]\.?[оО]\.?[рР].?[мМ]\b'):'система оперативно розыскных мероприятий',
         re.compile(r'\b[мМ]\.?[вВ]\.?[дД]\b'):'министерство внутренних дел',
         re.compile(r'\b[фФ]\.?[сС]\.?[бБ]\b'):'федеральная служба безопасности',
         re.compile(r'\b[фФ]\.?[нН]\.?[сС]\b'):'федеральная налоговая служба',
         re.compile(r'\b[сС]\.?[кК]\b'):'следственный комитет',
         re.compile(r'\b[уУ]\.?[кК]\b'):'уголовный кодекс',
         re.compile(r'\b[рР]\.?[фФ]\b'):'российская федерация',
         re.compile(r'\b[фФ]\.?[сС]\.?[кК]\.?[нН]\b'):'федеральная служба контроль наркотики',
         re.compile(r'\b[фФ]\.?[мМ]\.?[сС]\b'):'федеральная миграционная служба',
         re.compile(r'\b[фФ]\.?[сС]\.?[сС]\.?[пП]\b'):'федеральная служба судебных приставов',
         re.compile(r'\b[фФ]\.?[сС]\.?[иИ]\.?[нН]\b'):'федеральная служба исполнения наказаний',
         re.compile(r'\b[чЧ]\.?[вВ]\.?[кК]\b'):'частная военная компания',
         re.compile(r'\b[yY]\.?[oO]\.?[lL]\.?[oO]\b'):'один раз живем восклицание',
         re.compile(r'\b[оО]\.?[пП]\.?[бБ]\b'):'оперативно поисковое бюро',
         re.compile(r'\b[оО]\.?[рР]\.?[бБ]\b'):'оперативно разыскное бюро',
         re.compile(r'\b[оО]\.?[сС]\.?[бБ]\b'):'отдел собственной безопасности',
         re.compile(r'\b[уУ]\.?[эЭ]\.?[бБ]\b'):'управление экономической безопасности',
         re.compile(r'\b[уУ]\.?[эЭ]\.?[бБ]\b'):'управление экономической безопасности',
         re.compile(r'\b[оО]\.?[бБ]\.?[эЭ]\.?[пП]\b'):'отдел борьба экономичесние преступления',
         re.compile(r'\b[тТ]\.?[нН]\.?[нН]\b'):'бабы отрицание нужны',
         re.compile(r'(?i)\b(а\.?у\.?е|a\.?u\.?e)\b'):'арестантский уклад един'}